In [16]:
import pandas as pd
import numpy as np

In [17]:
s1 = {'Quarter 1': {'Milk' : 100, 'Beverages' : 90, 'Snack Items' : 40, 'Icecreams' : 50, 'Bakery Items' : 20 },
               'Quarter 2': {'Milk' : 10, 'Beverages' : 104, 'Snack Items' : 50, 'Icecreams' : 70, 'Bakery Items' : 30 },
               'Quarter 3': {'Milk' : 80, 'Beverages' : 20, 'Snack Items' : 30, 'Icecreams' : 60, 'Bakery Items' : 70 },
               'Quarter 4': {'Milk' : 100, 'Beverages' : 40, 'Snack Items' : 10, 'Icecreams' : 90, 'Bakery Items' : 100 }}

In [18]:
Sales15 = pd.DataFrame(s1)

In [19]:
Sales15

              Quarter 1  Quarter 2  Quarter 3  Quarter 4
Milk                100         10         80        100
Beverages            90        104         20         40
Snack Items          40         50         30         10
Icecreams            50         70         60         90
Bakery Items         20         30         70        100

In [27]:
Sales15.idxmax()

Quarter 1         Milk
Quarter 2    Beverages
Quarter 3         Milk
Quarter 4         Milk
dtype: object

In [33]:
Sales15.max(axis=1)

Milk            100
Beverages       104
Snack Items      50
Icecreams        90
Bakery Items    100
dtype: int64

In [37]:
Sales15.mean(axis=1)

Milk            72.5
Beverages       63.5
Snack Items     32.5
Icecreams       67.5
Bakery Items    55.0
dtype: float64

In [28]:
s2 = {'Quarter 1': {'Milk' : 200, 'Beverages' : 290, 'Snack Items' : 240, 'Icecreams' : 250, 'Bakery Items' : 220 },
               'Quarter 2': {'Milk' : 210, 'Beverages' : 214, 'Snack Items' : 250, 'Icecreams' : 270, 'Bakery Items' : 230 },
               'Quarter 3': {'Milk' : 280, 'Beverages' : 220, 'Snack Items' : 230, 'Icecreams' : 260, 'Bakery Items' : 270 },
               'Quarter 4': {'Milk' : 200, 'Beverages' : 240, 'Snack Items' : 210, 'Icecreams' : 290, 'Bakery Items' : 200 }}

In [29]:
Sales16 = pd.DataFrame(s2)

In [30]:
Sales16

              Quarter 1  Quarter 2  Quarter 3  Quarter 4
Milk                200        210        280        200
Beverages           290        214        220        240
Snack Items         240        250        230        210
Icecreams           250        270        260        290
Bakery Items        220        230        270        200

In [31]:
Sales16.idxmax()

Quarter 1    Beverages
Quarter 2    Icecreams
Quarter 3         Milk
Quarter 4    Icecreams
dtype: object

In [34]:
Sales16.max(axis=1)

Milk            280
Beverages       290
Snack Items     250
Icecreams       290
Bakery Items    270
dtype: int64

In [38]:
Sales16.mean(axis=1)

Milk            222.5
Beverages       241.0
Snack Items     232.5
Icecreams       267.5
Bakery Items    230.0
dtype: float64

In [23]:
s3 = {'Quarter 1': {'Milk' : 300, 'Beverages' : 390, 'Snack Items' : 330, 'Icecreams' : 350, 'Bakery Items' : 320 },
               'Quarter 2': {'Milk' : 310, 'Beverages' : 314, 'Snack Items' : 350, 'Icecreams' : 370, 'Bakery Items' : 330 },
               'Quarter 3': {'Milk' : 380, 'Beverages' : 320, 'Snack Items' : 330, 'Icecreams' : 360, 'Bakery Items' : 270 },
               'Quarter 4': {'Milk' : 300, 'Beverages' : 340, 'Snack Items' : 310, 'Icecreams' : 390, 'Bakery Items' : 300 }}

In [24]:
Sales17 = pd.DataFrame(s3)

In [25]:
Sales17

              Quarter 1  Quarter 2  Quarter 3  Quarter 4
Milk                300        310        380        300
Beverages           390        314        320        340
Snack Items         330        350        330        310
Icecreams           350        370        360        390
Bakery Items        320        330        270        300

In [32]:
Sales17.idxmax()

Quarter 1    Beverages
Quarter 2    Icecreams
Quarter 3         Milk
Quarter 4    Icecreams
dtype: object

In [35]:
Sales17.max(axis=1)

Milk            380
Beverages       390
Snack Items     350
Icecreams       390
Bakery Items    330
dtype: int64

In [39]:
Sales17.mean(axis=1)

Milk            322.5
Beverages       341.0
Snack Items     330.0
Icecreams       367.5
Bakery Items    305.0
dtype: float64

In [58]:
SalesCombined = pd.concat([Sales15,Sales16,Sales17])

In [59]:
SalesCombined

              Quarter 1  Quarter 2  Quarter 3  Quarter 4
Milk                100         10         80        100
Beverages            90        104         20         40
Snack Items          40         50         30         10
Icecreams            50         70         60         90
Bakery Items         20         30         70        100
Milk                200        210        280        200
Beverages           290        214        220        240
Snack Items         240        250        230        210
Icecreams           250        270        260        290
Bakery Items        220        230        270        200
Milk                300        310        380        300
Beverages           390        314        320        340
Snack Items         330        350        330        310
Icecreams           350        370        360        390
Bakery Items        320        330        270        300

In [60]:
SalesCombined.mean(axis=1)

Milk             72.5
Beverages        63.5
Snack Items      32.5
Icecreams        67.5
Bakery Items     55.0
Milk            222.5
Beverages       241.0
Snack Items     232.5
Icecreams       267.5
Bakery Items    230.0
Milk            322.5
Beverages       341.0
Snack Items     330.0
Icecreams       367.5
Bakery Items    305.0
dtype: float64